In [52]:
import boto3
import yaml
import pandas as pd
from io import StringIO
import numpy as np

In [53]:
date_times_df = pd.read_json('https://data-handling-public.s3.eu-west-1.amazonaws.com/date_details.json')

In [54]:
date_times_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 120161 entries, 0 to 120160
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   timestamp    120161 non-null  object
 1   month        120161 non-null  object
 2   year         120161 non-null  object
 3   day          120161 non-null  object
 4   time_period  120161 non-null  object
 5   date_uuid    120161 non-null  object
dtypes: object(6)
memory usage: 6.4+ MB

In [55]:
date_times_df.replace({'NULL': np.nan, 'nan': np.nan}, inplace=True)

In [56]:
date_times_df.dropna().drop_duplicates()

,timestamp,month,year,day,time_period,date_uuid
0,22:00:06,9,2012,19,Evening,3b7ca996-37f9-433f-b6d0-ce8391b615ad
1,22:44:06,2,1997,10,Evening,adc86836-6c35-49ca-bb0d-65b6507a00fa
2,10:05:37,4,1994,15,Morning,5ff791bf-d8e0-4f86-8ceb-c7b60bef9b31
3,17:29:27,11,2001,6,Midday,1b01fcef-5ab9-404c-b0d4-1e75a0bd19d8
4,22:40:33,12,2015,31,Evening,dfa907c1-f6c5-40f0-aa0d-40ed77ac5a44
...,...,...,...,...,...,...
120156,22:56:56,11,2022,12,Evening,d6c4fb31-720d-4e94-aa6b-dcbcb85f2bb7
120157,18:25:20,5,1997,31,Evening,f7722027-1aae-49c3-8f8d-853e93f9f3e6
120158,18:21:40,9,2011,13,Evening,4a3b9851-52e1-463c-ac81-1960f141444e
120159,19:10:53,7,2013,12,Evening,64974909-0d4b-42a2-822a-73b5695e8bfb
120160,21:17:12,3,2008,18,Evening,55c228c7-14ee-4d46-99a9-01dfc57d1adf

In [57]:
def clean_month_data(month):
    cleaned_data = []
    for month_data in month:
        # Remove non-numeric characters and check if the string is numeric
        cleaned_month = ''.join(filter(str.isdigit, month_data))
        
        # Convert valid numeric strings to integers
        if cleaned_month.isdigit():
            cleaned_month = int(cleaned_month)
            # Validate if the month value is within the range (1 to 12)
            if 1 <= cleaned_month <= 12:
                cleaned_data.append(cleaned_month)
            else:
                # Handle invalid month values by replacing with None
                cleaned_data.append(None)
        else:
            # Handle non-numeric or invalid values by replacing with None
            cleaned_data.append(None)
    return cleaned_data

month = date_times_df['month']
date_times_df['month'] = clean_month_data(month)

TypeError: 'float' object is not iterable

In [51]:
var_1 = list(date_times_df['month'].unique())
var_1

[9.0, 2.0, 4.0, 11.0, 12.0, 8.0, 1.0, 3.0, 7.0, 10.0, 5.0, 6.0, nan]